{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\Isaac\Documents\GitHub\soc-analysis\Econ643 - Update.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}23 Sep 2018, 13:50:42
{txt}
{com}. 
. ******************************************************************
. ************************** ECON 643 ******************************
. ************************* Data Project ***************************
. **************************Isaac Booth*****************************
. ******************************************************************
. 
. **********************Importing the Data**************************
. 
. clear
{txt}
{com}. import excel "soc17.xls", sheet("soc17") firstrow
{res}{txt}
{com}. 
. *************************Data Cleaning****************************
. 
. 
. *turning strings into numeric for analysis
. foreach x in "FINC" "ACS" "AGER" "ASSOC" "BASE" "CAT" "CLOS" "CON" "DET" "DIV" "FNBS" "FOYER" "FRAME" "GAR" "HEAT" "HEAT2" "LNDR" "METRO" "MFGS" "SEWER" "STOR" "WAL1" "WAL2" "WALS" "WATER" "AREA" "BEDR" "FFNSQ" "FPLS" "FULB" "HAFB" "LOTV" "FSQFS" {c -(}
{txt}  2{com}.         destring `x', replace
{txt}  3{com}. {c )-}
{txt}FINC: all characters numeric; {res}replaced {txt}as {res}byte
{txt}ACS already numeric; no {res}replace
{txt}AGER already numeric; no {res}replace
{txt}ASSOC already numeric; no {res}replace
{txt}BASE: all characters numeric; {res}replaced {txt}as {res}byte
{txt}CAT already numeric; no {res}replace
{txt}CLOS already numeric; no {res}replace
{txt}CON already numeric; no {res}replace
{txt}DET already numeric; no {res}replace
{txt}DIV already numeric; no {res}replace
{txt}FNBS already numeric; no {res}replace
{txt}FOYER already numeric; no {res}replace
{txt}FRAME already numeric; no {res}replace
{txt}GAR already numeric; no {res}replace
{txt}HEAT: all characters numeric; {res}replaced {txt}as {res}byte
{txt}HEAT2: all characters numeric; {res}replaced {txt}as {res}byte
{txt}LNDR already numeric; no {res}replace
{txt}METRO already numeric; no {res}replace
{txt}MFGS already numeric; no {res}replace
{txt}SEWER already numeric; no {res}replace
{txt}STOR already numeric; no {res}replace
{txt}WAL1: all characters numeric; {res}replaced {txt}as {res}byte
{txt}WAL2: all characters numeric; {res}replaced {txt}as {res}byte
{txt}WALS already numeric; no {res}replace
{txt}WATER already numeric; no {res}replace
{txt}AREA already numeric; no {res}replace
{txt}BEDR already numeric; no {res}replace
{txt}FFNSQ already numeric; no {res}replace
{txt}FPLS already numeric; no {res}replace
{txt}FULB already numeric; no {res}replace
{txt}HAFB already numeric; no {res}replace
{txt}LOTV already numeric; no {res}replace
{txt}FSQFS already numeric; no {res}replace
{txt}
{com}. 
. *cleaning dummy variables
. gen acs = .
{txt}(23,690 missing values generated)

{com}. replace acs = 1 if ACS==1
{txt}(21,446 real changes made)

{com}. replace acs = 0 if ACS==2
{txt}(1,464 real changes made)

{com}. 
. gen ager = .
{txt}(23,690 missing values generated)

{com}. replace ager = 1 if AGER==1
{txt}(604 real changes made)

{com}. replace ager = 0 if AGER==2
{txt}(22,906 real changes made)

{com}. 
. gen assoc = .
{txt}(23,690 missing values generated)

{com}. replace assoc = 1 if ASSOC==1
{txt}(13,045 real changes made)

{com}. replace assoc = 0 if ASSOC==2
{txt}(10,254 real changes made)

{com}. 
. gen con = .
{txt}(23,690 missing values generated)

{com}. replace con = 1 if CON==1
{txt}(527 real changes made)

{com}. replace con = 0 if CON==2
{txt}(12,906 real changes made)

{com}. 
. gen det = .
{txt}(23,690 missing values generated)

{com}. replace det = 1 if DET==1
{txt}(20,767 real changes made)

{com}. replace det = 0 if DET==2
{txt}(2,881 real changes made)

{com}. 
. gen fnbs = .
{txt}(23,690 missing values generated)

{com}. replace fnbs = 1 if FNBS==1
{txt}(2,314 real changes made)

{com}. replace fnbs = 0 if FNBS==2
{txt}(4,856 real changes made)

{com}. 
. gen foyer = .
{txt}(23,690 missing values generated)

{com}. replace foyer = 1 if FOYER==1
{txt}(4,270 real changes made)

{com}. replace foyer = 0 if FOYER==2
{txt}(8,627 real changes made)

{com}. 
. gen metro = .
{txt}(23,690 missing values generated)

{com}. replace metro = 1 if METRO==1
{txt}(21,591 real changes made)

{com}. replace metro = 0 if METRO==2
{txt}(2,099 real changes made)

{com}. 
. gen wals = .
{txt}(23,690 missing values generated)

{com}. replace wals = 1 if WALS==1
{txt}(11,944 real changes made)

{com}. replace wals = 0 if WALS==2
{txt}(10,370 real changes made)

{com}. 
. 
.  
. *create "treatment" dummy variable
. gen FIN = 0
{txt}
{com}. replace FIN = 1 if FINC == 2
{txt}(1,267 real changes made)

{com}. drop if FSLPR == 0
{txt}(17,894 observations deleted)

{com}. 
. *make and assign labels
. label define labb 0 CONVENTIONAL 1 FHA
{txt}
{com}. label values FIN labb
{txt}
{com}. 
. *create histogram of distributions for initial analysis
. histogram FSLPR, bin(20) percent by(FIN)
{res}{txt}
{com}. graph save Graph "FHA & Conventional Loan Distributions.gph",replace
{res}{txt}(file FHA & Conventional Loan Distributions.gph saved)

{com}. 
. *specify sale price as log
. gen logFSLPR = log(FSLPR)
{txt}
{com}. 
. ************************Data Analysis*****************************
. 
. *run simplest specification of the analysis
. reg logFSLPR FIN [iw=WEIGHT]

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}   376,938
{txt}{hline 13}{c +}{hline 34}   F(1, 376936)    = {res} 37820.18
{txt}       Model {c |} {res} 6513.35976         1  6513.35976   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}  64915.595   376,936  .172219143   {txt}R-squared       ={res}    0.0912
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0912
{txt}       Total {c |} {res} 71428.9547   376,937   .18949839   {txt}Root MSE        =   {res} .41499

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    logFSLPR{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}FIN {c |}{col 14}{res}{space 2}-.3844687{col 26}{space 2}  .001977{col 37}{space 1} -194.47{col 46}{space 3}0.000{col 54}{space 4}-.3883435{col 67}{space 3}-.3805939
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 12.76927{col 26}{space 2} .0007268{col 37}{space 1} 1.8e+04{col 46}{space 3}0.000{col 54}{space 4} 12.76784{col 67}{space 3} 12.77069
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. est sto fin1
{txt}
{com}. 
. *add potential controls
. reg logFSLPR FIN acs ager assoc i.BASE i.CAT con det i.DIV fnbs foyer i.FRAME i.GAR i.HEAT i.HEAT2 i.LNDR metro i.MFGS i.SEWER i.STOR i.WAL1 i.WAL2 wals i.WATER AREA i.BEDR FFNSQ FPLS FULB HAFB LOTV FSQFS [iw=WEIGHT]
{p 0 6 2}{txt}note: 1.BASE omitted because of collinearity{p_end}
{p 0 6 2}note: 1.CAT omitted because of collinearity{p_end}
{p 0 6 2}note: wals omitted because of collinearity{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}    56,609
{txt}{hline 13}{c +}{hline 34}   F(60, 56548)    = {res}  1601.06
{txt}       Model {c |} {res} 5989.57085        60  99.8261808   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 3525.77333    56,548  .062350098   {txt}R-squared       ={res}    0.6295
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6291
{txt}       Total {c |} {res} 9515.34418    56,608  .168091863   {txt}Root MSE        =   {res}  .2497

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    logFSLPR{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}FIN {c |}{col 14}{res}{space 2}-.0801876{col 26}{space 2} .0046164{col 37}{space 1}  -17.37{col 46}{space 3}0.000{col 54}{space 4}-.0892359{col 67}{space 3}-.0711394
{txt}{space 9}acs {c |}{col 14}{res}{space 2} .0844746{col 26}{space 2} .0054449{col 37}{space 1}   15.51{col 46}{space 3}0.000{col 54}{space 4} .0738025{col 67}{space 3} .0951467
{txt}{space 8}ager {c |}{col 14}{res}{space 2} .0432701{col 26}{space 2} .0065696{col 37}{space 1}    6.59{col 46}{space 3}0.000{col 54}{space 4} .0303936{col 67}{space 3} .0561466
{txt}{space 7}assoc {c |}{col 14}{res}{space 2}-.0019114{col 26}{space 2} .0028777{col 37}{space 1}   -0.66{col 46}{space 3}0.507{col 54}{space 4}-.0075517{col 67}{space 3} .0037288
{txt}{space 6}1.BASE {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 7}1.CAT {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}con {c |}{col 14}{res}{space 2} .1260579{col 26}{space 2} .0063458{col 37}{space 1}   19.86{col 46}{space 3}0.000{col 54}{space 4} .1136202{col 67}{space 3} .1384956
{txt}{space 9}det {c |}{col 14}{res}{space 2}   .03712{col 26}{space 2} .0046448{col 37}{space 1}    7.99{col 46}{space 3}0.000{col 54}{space 4} .0280162{col 67}{space 3} .0462238
{txt}{space 12} {c |}
{space 9}DIV {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.2889512{col 26}{space 2} .0056993{col 37}{space 1}  -50.70{col 46}{space 3}0.000{col 54}{space 4}-.3001219{col 67}{space 3}-.2777806
{txt}{space 10}3  {c |}{col 14}{res}{space 2} -.429448{col 26}{space 2} .0056546{col 37}{space 1}  -75.95{col 46}{space 3}0.000{col 54}{space 4}-.4405309{col 67}{space 3} -.418365
{txt}{space 10}4  {c |}{col 14}{res}{space 2}-.5232136{col 26}{space 2} .0063282{col 37}{space 1}  -82.68{col 46}{space 3}0.000{col 54}{space 4}-.5356169{col 67}{space 3}-.5108104
{txt}{space 10}5  {c |}{col 14}{res}{space 2}-.3680902{col 26}{space 2} .0059237{col 37}{space 1}  -62.14{col 46}{space 3}0.000{col 54}{space 4}-.3797006{col 67}{space 3}-.3564798
{txt}{space 10}6  {c |}{col 14}{res}{space 2}-.6769176{col 26}{space 2} .0089864{col 37}{space 1}  -75.33{col 46}{space 3}0.000{col 54}{space 4}-.6945309{col 67}{space 3}-.6593042
{txt}{space 10}8  {c |}{col 14}{res}{space 2}-.4141907{col 26}{space 2} .0060119{col 37}{space 1}  -68.89{col 46}{space 3}0.000{col 54}{space 4}-.4259741{col 67}{space 3}-.4024073
{txt}{space 10}9  {c |}{col 14}{res}{space 2} .2489634{col 26}{space 2} .0181342{col 37}{space 1}   13.73{col 46}{space 3}0.000{col 54}{space 4} .2134202{col 67}{space 3} .2845066
{txt}{space 12} {c |}
{space 8}fnbs {c |}{col 14}{res}{space 2} -.043391{col 26}{space 2} .0028549{col 37}{space 1}  -15.20{col 46}{space 3}0.000{col 54}{space 4}-.0489867{col 67}{space 3}-.0377954
{txt}{space 7}foyer {c |}{col 14}{res}{space 2} .0526708{col 26}{space 2} .0024522{col 37}{space 1}   21.48{col 46}{space 3}0.000{col 54}{space 4} .0478645{col 67}{space 3} .0574771
{txt}{space 12} {c |}
{space 7}FRAME {c |}
{space 10}1  {c |}{col 14}{res}{space 2} -.610818{col 26}{space 2} .0400506{col 37}{space 1}  -15.25{col 46}{space 3}0.000{col 54}{space 4}-.6893174{col 67}{space 3}-.5323186
{txt}{space 10}4  {c |}{col 14}{res}{space 2}-.4031241{col 26}{space 2} .0549903{col 37}{space 1}   -7.33{col 46}{space 3}0.000{col 54}{space 4}-.5109053{col 67}{space 3}-.2953428
{txt}{space 12} {c |}
{space 9}GAR {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .0287115{col 26}{space 2} .0063033{col 37}{space 1}    4.55{col 46}{space 3}0.000{col 54}{space 4}  .016357{col 67}{space 3}  .041066
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .1029159{col 26}{space 2} .0069566{col 37}{space 1}   14.79{col 46}{space 3}0.000{col 54}{space 4}  .089281{col 67}{space 3} .1165509
{txt}{space 10}4  {c |}{col 14}{res}{space 2}-.0340011{col 26}{space 2}  .016301{col 37}{space 1}   -2.09{col 46}{space 3}0.037{col 54}{space 4}-.0659511{col 67}{space 3}-.0020512
{txt}{space 12} {c |}
{space 8}HEAT {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .1150748{col 26}{space 2} .0039981{col 37}{space 1}   28.78{col 46}{space 3}0.000{col 54}{space 4} .1072384{col 67}{space 3} .1229112
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .0115502{col 26}{space 2} .0108326{col 37}{space 1}    1.07{col 46}{space 3}0.286{col 54}{space 4}-.0096817{col 67}{space 3} .0327822
{txt}{space 10}4  {c |}{col 14}{res}{space 2} .1918684{col 26}{space 2} .0309135{col 37}{space 1}    6.21{col 46}{space 3}0.000{col 54}{space 4} .1312779{col 67}{space 3}  .252459
{txt}{space 12} {c |}
{space 7}HEAT2 {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .1747473{col 26}{space 2} .0080723{col 37}{space 1}   21.65{col 46}{space 3}0.000{col 54}{space 4} .1589256{col 67}{space 3} .1905691
{txt}{space 10}2  {c |}{col 14}{res}{space 2}-.0834937{col 26}{space 2} .0383798{col 37}{space 1}   -2.18{col 46}{space 3}0.030{col 54}{space 4}-.1587183{col 67}{space 3}-.0082691
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.0733469{col 26}{space 2} .0487262{col 37}{space 1}   -1.51{col 46}{space 3}0.132{col 54}{space 4}-.1688505{col 67}{space 3} .0221567
{txt}{space 10}4  {c |}{col 14}{res}{space 2} .1454982{col 26}{space 2} .0095209{col 37}{space 1}   15.28{col 46}{space 3}0.000{col 54}{space 4} .1268371{col 67}{space 3} .1641593
{txt}{space 12} {c |}
{space 8}LNDR {c |}
{space 10}1  {c |}{col 14}{res}{space 2}-.2410711{col 26}{space 2} .0133232{col 37}{space 1}  -18.09{col 46}{space 3}0.000{col 54}{space 4}-.2671847{col 67}{space 3}-.2149576
{txt}{space 10}2  {c |}{col 14}{res}{space 2}-.1584056{col 26}{space 2} .0123243{col 37}{space 1}  -12.85{col 46}{space 3}0.000{col 54}{space 4}-.1825614{col 67}{space 3}-.1342499
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.1566912{col 26}{space 2} .0122644{col 37}{space 1}  -12.78{col 46}{space 3}0.000{col 54}{space 4}-.1807294{col 67}{space 3} -.132653
{txt}{space 10}5  {c |}{col 14}{res}{space 2}-.1260978{col 26}{space 2} .0492004{col 37}{space 1}   -2.56{col 46}{space 3}0.010{col 54}{space 4}-.2225309{col 67}{space 3}-.0296648
{txt}{space 10}6  {c |}{col 14}{res}{space 2}-.2611507{col 26}{space 2} .0188564{col 37}{space 1}  -13.85{col 46}{space 3}0.000{col 54}{space 4}-.2981094{col 67}{space 3} -.224192
{txt}{space 12} {c |}
{space 7}metro {c |}{col 14}{res}{space 2}-.0903645{col 26}{space 2} .0191346{col 37}{space 1}   -4.72{col 46}{space 3}0.000{col 54}{space 4}-.1278685{col 67}{space 3}-.0528606
{txt}{space 12} {c |}
{space 8}MFGS {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .2285714{col 26}{space 2} .0137247{col 37}{space 1}   16.65{col 46}{space 3}0.000{col 54}{space 4}  .201671{col 67}{space 3} .2554719
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .1405525{col 26}{space 2} .0129372{col 37}{space 1}   10.86{col 46}{space 3}0.000{col 54}{space 4} .1151956{col 67}{space 3} .1659095
{txt}{space 12} {c |}
{space 5}2.SEWER {c |}{col 14}{res}{space 2}   .04145{col 26}{space 2}  .006756{col 37}{space 1}    6.14{col 46}{space 3}0.000{col 54}{space 4} .0282083{col 67}{space 3} .0546918
{txt}{space 6}3.STOR {c |}{col 14}{res}{space 2} .0836174{col 26}{space 2} .0073157{col 37}{space 1}   11.43{col 46}{space 3}0.000{col 54}{space 4} .0692786{col 67}{space 3} .0979562
{txt}{space 12} {c |}
{space 8}WAL1 {c |}
{space 10}2  {c |}{col 14}{res}{space 2}  .065525{col 26}{space 2} .0074867{col 37}{space 1}    8.75{col 46}{space 3}0.000{col 54}{space 4} .0508509{col 67}{space 3}  .080199
{txt}{space 10}4  {c |}{col 14}{res}{space 2} -.096328{col 26}{space 2} .0076648{col 37}{space 1}  -12.57{col 46}{space 3}0.000{col 54}{space 4} -.111351{col 67}{space 3}-.0813049
{txt}{space 10}5  {c |}{col 14}{res}{space 2}-.0956997{col 26}{space 2} .0060638{col 37}{space 1}  -15.78{col 46}{space 3}0.000{col 54}{space 4}-.1075849{col 67}{space 3}-.0838146
{txt}{space 10}7  {c |}{col 14}{res}{space 2} .0062551{col 26}{space 2} .0111889{col 37}{space 1}    0.56{col 46}{space 3}0.576{col 54}{space 4}-.0156752{col 67}{space 3} .0281855
{txt}{space 10}8  {c |}{col 14}{res}{space 2}-.0034006{col 26}{space 2} .0065081{col 37}{space 1}   -0.52{col 46}{space 3}0.601{col 54}{space 4}-.0161564{col 67}{space 3} .0093553
{txt}{space 12} {c |}
{space 8}WAL2 {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0612277{col 26}{space 2} .0106999{col 37}{space 1}    5.72{col 46}{space 3}0.000{col 54}{space 4} .0402559{col 67}{space 3} .0821995
{txt}{space 10}2  {c |}{col 14}{res}{space 2} .0592138{col 26}{space 2} .0037262{col 37}{space 1}   15.89{col 46}{space 3}0.000{col 54}{space 4} .0519105{col 67}{space 3} .0665172
{txt}{space 10}4  {c |}{col 14}{res}{space 2} .0677391{col 26}{space 2} .0091241{col 37}{space 1}    7.42{col 46}{space 3}0.000{col 54}{space 4} .0498557{col 67}{space 3} .0856224
{txt}{space 10}5  {c |}{col 14}{res}{space 2}-.0706054{col 26}{space 2} .0065029{col 37}{space 1}  -10.86{col 46}{space 3}0.000{col 54}{space 4} -.083351{col 67}{space 3}-.0578597
{txt}{space 10}7  {c |}{col 14}{res}{space 2} .0940936{col 26}{space 2} .0032192{col 37}{space 1}   29.23{col 46}{space 3}0.000{col 54}{space 4} .0877841{col 67}{space 3} .1004032
{txt}{space 10}8  {c |}{col 14}{res}{space 2} .0907239{col 26}{space 2} .0053521{col 37}{space 1}   16.95{col 46}{space 3}0.000{col 54}{space 4} .0802336{col 67}{space 3} .1012141
{txt}{space 12} {c |}
{space 8}wals {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}2.WATER {c |}{col 14}{res}{space 2}-.0909665{col 26}{space 2} .0081455{col 37}{space 1}  -11.17{col 46}{space 3}0.000{col 54}{space 4}-.1069317{col 67}{space 3}-.0750013
{txt}{space 8}AREA {c |}{col 14}{res}{space 2} 2.97e-07{col 26}{space 2} 8.55e-08{col 37}{space 1}    3.47{col 46}{space 3}0.001{col 54}{space 4} 1.29e-07{col 67}{space 3} 4.64e-07
{txt}{space 12} {c |}
{space 8}BEDR {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .0286811{col 26}{space 2} .0245907{col 37}{space 1}    1.17{col 46}{space 3}0.243{col 54}{space 4}-.0195168{col 67}{space 3} .0768791
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.0025559{col 26}{space 2} .0236747{col 37}{space 1}   -0.11{col 46}{space 3}0.914{col 54}{space 4}-.0489585{col 67}{space 3} .0438466
{txt}{space 10}4  {c |}{col 14}{res}{space 2}  .093463{col 26}{space 2} .0234706{col 37}{space 1}    3.98{col 46}{space 3}0.000{col 54}{space 4} .0474604{col 67}{space 3} .1394656
{txt}{space 10}5  {c |}{col 14}{res}{space 2} .0400365{col 26}{space 2} .0234026{col 37}{space 1}    1.71{col 46}{space 3}0.087{col 54}{space 4}-.0058327{col 67}{space 3} .0859056
{txt}{space 12} {c |}
{space 7}FFNSQ {c |}{col 14}{res}{space 2}-.0000168{col 26}{space 2} 5.93e-06{col 37}{space 1}   -2.84{col 46}{space 3}0.005{col 54}{space 4}-.0000285{col 67}{space 3}-5.22e-06
{txt}{space 8}FPLS {c |}{col 14}{res}{space 2} .0337686{col 26}{space 2} .0015447{col 37}{space 1}   21.86{col 46}{space 3}0.000{col 54}{space 4}  .030741{col 67}{space 3} .0367963
{txt}{space 8}FULB {c |}{col 14}{res}{space 2} .1241453{col 26}{space 2} .0023044{col 37}{space 1}   53.87{col 46}{space 3}0.000{col 54}{space 4} .1196287{col 67}{space 3} .1286619
{txt}{space 8}HAFB {c |}{col 14}{res}{space 2} .0747142{col 26}{space 2} .0031504{col 37}{space 1}   23.72{col 46}{space 3}0.000{col 54}{space 4} .0685394{col 67}{space 3} .0808889
{txt}{space 8}LOTV {c |}{col 14}{res}{space 2} 1.20e-06{col 26}{space 2} 1.83e-08{col 37}{space 1}   65.68{col 46}{space 3}0.000{col 54}{space 4} 1.17e-06{col 67}{space 3} 1.24e-06
{txt}{space 7}FSQFS {c |}{col 14}{res}{space 2} .0000953{col 26}{space 2} 1.20e-06{col 37}{space 1}   79.69{col 46}{space 3}0.000{col 54}{space 4}  .000093{col 67}{space 3} .0000976
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 12.93547{col 26}{space 2}  .054558{col 37}{space 1}  237.10{col 46}{space 3}0.000{col 54}{space 4} 12.82854{col 67}{space 3} 13.04241
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. *postestimation to check for multicollinearity
. vif

{txt}    Variable {c |}       VIF       1/VIF  
{hline 13}{c +}{hline 22}
{space 9}FIN {c |} {res}     1.14    0.879961
{txt}{space 9}acs {c |} {res}     1.34    0.747314
{txt}{space 8}ager {c |} {res}     1.26    0.792374
{txt}{space 7}assoc {c |} {res}     1.38    0.725417
{txt}{space 9}con {c |} {res}     2.07    0.483300
{txt}{space 9}det {c |} {res}     2.05    0.488002
{txt}{space 9}DIV {c |}
{space 10}2  {c |} {res}     3.25    0.307533
{txt}{space 10}3  {c |} {res}     3.85    0.259574
{txt}{space 10}4  {c |} {res}     3.44    0.290346
{txt}{space 10}5  {c |} {res}     5.47    0.182664
{txt}{space 10}6  {c |} {res}     1.86    0.537813
{txt}{space 10}8  {c |} {res}     6.11    0.163558
{txt}{space 10}9  {c |} {res}     1.28    0.780414
{txt}{space 8}fnbs {c |} {res}     1.66    0.601732
{txt}{space 7}foyer {c |} {res}     1.27    0.787043
{txt}{space 7}FRAME {c |}
{space 10}1  {c |} {res}     2.21    0.452669
{txt}{space 10}4  {c |} {res}     2.23    0.448602
{txt}{space 9}GAR {c |}
{space 10}2  {c |} {res}     8.45    0.118366
{txt}{space 10}3  {c |} {res}     9.51    0.105099
{txt}{space 10}4  {c |} {res}     1.80    0.554986
{txt}{space 8}HEAT {c |}
{space 10}2  {c |} {res}     1.46    0.683414
{txt}{space 10}3  {c |} {res}     1.42    0.705896
{txt}{space 10}4  {c |} {res}     1.09    0.920087
{txt}{space 7}HEAT2 {c |}
{space 10}1  {c |} {res}     1.16    0.861771
{txt}{space 10}2  {c |} {res}     1.04    0.962759
{txt}{space 10}3  {c |} {res}     1.03    0.973097
{txt}{space 10}4  {c |} {res}     1.11    0.902129
{txt}{space 8}LNDR {c |}
{space 10}1  {c |} {res}     7.39    0.135372
{txt}{space 10}2  {c |} {res}    31.42    0.031826
{txt}{space 10}3  {c |} {res}    33.13    0.030182
{txt}{space 10}5  {c |} {res}     1.13    0.888637
{txt}{space 10}6  {c |} {res}     2.07    0.482231
{txt}{space 7}metro {c |} {res}     1.60    0.624531
{txt}{space 8}MFGS {c |}
{space 10}2  {c |} {res}     8.50    0.117658
{txt}{space 10}3  {c |} {res}     8.53    0.117278
{txt}{space 5}2.SEWER {c |} {res}     2.81    0.356153
{txt}{space 6}3.STOR {c |} {res}     1.15    0.867748
{txt}{space 8}WAL1 {c |}
{space 10}2  {c |} {res}     4.81    0.207834
{txt}{space 10}4  {c |} {res}     4.23    0.236243
{txt}{space 10}5  {c |} {res}     8.25    0.121284
{txt}{space 10}7  {c |} {res}     1.81    0.551467
{txt}{space 10}8  {c |} {res}     8.09    0.123630
{txt}{space 8}WAL2 {c |}
{space 10}1  {c |} {res}     1.11    0.901057
{txt}{space 10}2  {c |} {res}     1.90    0.525533
{txt}{space 10}4  {c |} {res}     1.15    0.869383
{txt}{space 10}5  {c |} {res}     1.79    0.559483
{txt}{space 10}7  {c |} {res}     2.21    0.452391
{txt}{space 10}8  {c |} {res}     1.97    0.507597
{txt}{space 5}2.WATER {c |} {res}     2.65    0.376765
{txt}{space 8}AREA {c |} {res}     2.14    0.467146
{txt}{space 8}BEDR {c |}
{space 10}2  {c |} {res}    26.64    0.037536
{txt}{space 10}3  {c |} {res}   105.44    0.009484
{txt}{space 10}4  {c |} {res}   124.50    0.008032
{txt}{space 10}5  {c |} {res}    75.38    0.013266
{txt}{space 7}FFNSQ {c |} {res}     1.14    0.881023
{txt}{space 8}FPLS {c |} {res}     1.18    0.849309
{txt}{space 8}FULB {c |} {res}     3.03    0.329948
{txt}{space 8}HAFB {c |} {res}     1.37    0.730634
{txt}{space 8}LOTV {c |} {res}     1.29    0.775571
{txt}{space 7}FSQFS {c |} {res}     2.24    0.447269
{txt}{hline 13}{c +}{hline 22}
    Mean VIF {c |} {res}     9.20
{txt}
{com}. est sto fin2
{txt}
{com}. 
. /*
> Variables removed due to high VIF:
> BEDR(number of bedroom)
> LNDR(location of laundry room)
> GAR(type of parking)
> MFGS(construction method)
> */
. 
. *second attempt
. reg logFSLPR FIN acs ager assoc i.BASE i.CAT con det i.DIV fnbs foyer i.FRAME i.HEAT i.HEAT2 metro i.SEWER i.STOR i.WAL1 i.WAL2 wals i.WATER AREA FFNSQ FPLS FULB HAFB LOTV FSQFS [iw=WEIGHT]
{p 0 6 2}{txt}note: 1.BASE omitted because of collinearity{p_end}
{p 0 6 2}note: 1.CAT omitted because of collinearity{p_end}
{p 0 6 2}note: wals omitted because of collinearity{p_end}

      Source {c |}       SS           df       MS      Number of obs   ={res}    56,609
{txt}{hline 13}{c +}{hline 34}   F(46, 56562)    = {res}  1908.86
{txt}       Model {c |} {res} 5787.36605        46  125.812305   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 3727.97813    56,562  .065909588   {txt}R-squared       ={res}    0.6082
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.6079
{txt}       Total {c |} {res} 9515.34418    56,608  .168091863   {txt}Root MSE        =   {res} .25673

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    logFSLPR{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 9}FIN {c |}{col 14}{res}{space 2}-.0933782{col 26}{space 2} .0047039{col 37}{space 1}  -19.85{col 46}{space 3}0.000{col 54}{space 4}-.1025977{col 67}{space 3}-.0841586
{txt}{space 9}acs {c |}{col 14}{res}{space 2} .0837442{col 26}{space 2} .0055493{col 37}{space 1}   15.09{col 46}{space 3}0.000{col 54}{space 4} .0728675{col 67}{space 3}  .094621
{txt}{space 8}ager {c |}{col 14}{res}{space 2} .0017017{col 26}{space 2} .0065073{col 37}{space 1}    0.26{col 46}{space 3}0.794{col 54}{space 4}-.0110527{col 67}{space 3} .0144561
{txt}{space 7}assoc {c |}{col 14}{res}{space 2} .0020881{col 26}{space 2} .0029186{col 37}{space 1}    0.72{col 46}{space 3}0.474{col 54}{space 4}-.0036323{col 67}{space 3} .0078085
{txt}{space 6}1.BASE {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 7}1.CAT {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 9}con {c |}{col 14}{res}{space 2}  .143875{col 26}{space 2} .0059912{col 37}{space 1}   24.01{col 46}{space 3}0.000{col 54}{space 4} .1321322{col 67}{space 3} .1556177
{txt}{space 9}det {c |}{col 14}{res}{space 2} .0977961{col 26}{space 2} .0041428{col 37}{space 1}   23.61{col 46}{space 3}0.000{col 54}{space 4} .0896763{col 67}{space 3} .1059159
{txt}{space 12} {c |}
{space 9}DIV {c |}
{space 10}2  {c |}{col 14}{res}{space 2}-.2683545{col 26}{space 2} .0056757{col 37}{space 1}  -47.28{col 46}{space 3}0.000{col 54}{space 4}-.2794789{col 67}{space 3}  -.25723
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.4092678{col 26}{space 2} .0056554{col 37}{space 1}  -72.37{col 46}{space 3}0.000{col 54}{space 4}-.4203523{col 67}{space 3}-.3981833
{txt}{space 10}4  {c |}{col 14}{res}{space 2}-.4809667{col 26}{space 2}  .006236{col 37}{space 1}  -77.13{col 46}{space 3}0.000{col 54}{space 4}-.4931894{col 67}{space 3}-.4687441
{txt}{space 10}5  {c |}{col 14}{res}{space 2}-.3568838{col 26}{space 2} .0058248{col 37}{space 1}  -61.27{col 46}{space 3}0.000{col 54}{space 4}-.3683005{col 67}{space 3}-.3454672
{txt}{space 10}6  {c |}{col 14}{res}{space 2}-.6440375{col 26}{space 2} .0087841{col 37}{space 1}  -73.32{col 46}{space 3}0.000{col 54}{space 4}-.6612544{col 67}{space 3}-.6268206
{txt}{space 10}8  {c |}{col 14}{res}{space 2}-.3976005{col 26}{space 2} .0060236{col 37}{space 1}  -66.01{col 46}{space 3}0.000{col 54}{space 4}-.4094069{col 67}{space 3}-.3857942
{txt}{space 10}9  {c |}{col 14}{res}{space 2} .2137769{col 26}{space 2} .0184837{col 37}{space 1}   11.57{col 46}{space 3}0.000{col 54}{space 4} .1775488{col 67}{space 3}  .250005
{txt}{space 12} {c |}
{space 8}fnbs {c |}{col 14}{res}{space 2} -.052611{col 26}{space 2} .0028796{col 37}{space 1}  -18.27{col 46}{space 3}0.000{col 54}{space 4}-.0582551{col 67}{space 3}-.0469669
{txt}{space 7}foyer {c |}{col 14}{res}{space 2} .0661809{col 26}{space 2} .0024599{col 37}{space 1}   26.90{col 46}{space 3}0.000{col 54}{space 4} .0613594{col 67}{space 3} .0710024
{txt}{space 12} {c |}
{space 7}FRAME {c |}
{space 10}1  {c |}{col 14}{res}{space 2}-.5323602{col 26}{space 2} .0409426{col 37}{space 1}  -13.00{col 46}{space 3}0.000{col 54}{space 4} -.612608{col 67}{space 3}-.4521124
{txt}{space 10}4  {c |}{col 14}{res}{space 2}-.3538651{col 26}{space 2} .0562226{col 37}{space 1}   -6.29{col 46}{space 3}0.000{col 54}{space 4}-.4640617{col 67}{space 3}-.2436684
{txt}{space 12} {c |}
{space 8}HEAT {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .1112937{col 26}{space 2} .0040507{col 37}{space 1}   27.48{col 46}{space 3}0.000{col 54}{space 4} .1033543{col 67}{space 3} .1192331
{txt}{space 10}3  {c |}{col 14}{res}{space 2} .0261768{col 26}{space 2} .0110514{col 37}{space 1}    2.37{col 46}{space 3}0.018{col 54}{space 4} .0045161{col 67}{space 3} .0478376
{txt}{space 10}4  {c |}{col 14}{res}{space 2} .1120639{col 26}{space 2} .0315981{col 37}{space 1}    3.55{col 46}{space 3}0.000{col 54}{space 4} .0501314{col 67}{space 3} .1739963
{txt}{space 12} {c |}
{space 7}HEAT2 {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .2090335{col 26}{space 2} .0080534{col 37}{space 1}   25.96{col 46}{space 3}0.000{col 54}{space 4} .1932488{col 67}{space 3} .2248181
{txt}{space 10}2  {c |}{col 14}{res}{space 2}-.0203859{col 26}{space 2} .0393906{col 37}{space 1}   -0.52{col 46}{space 3}0.605{col 54}{space 4}-.0975918{col 67}{space 3}   .05682
{txt}{space 10}3  {c |}{col 14}{res}{space 2}-.1246358{col 26}{space 2} .0500144{col 37}{space 1}   -2.49{col 46}{space 3}0.013{col 54}{space 4}-.2226643{col 67}{space 3}-.0266073
{txt}{space 10}4  {c |}{col 14}{res}{space 2} .1613145{col 26}{space 2} .0097489{col 37}{space 1}   16.55{col 46}{space 3}0.000{col 54}{space 4} .1422067{col 67}{space 3} .1804224
{txt}{space 12} {c |}
{space 7}metro {c |}{col 14}{res}{space 2}-.0173207{col 26}{space 2} .0170684{col 37}{space 1}   -1.01{col 46}{space 3}0.310{col 54}{space 4}-.0507749{col 67}{space 3} .0161334
{txt}{space 5}2.SEWER {c |}{col 14}{res}{space 2} .0294945{col 26}{space 2} .0068883{col 37}{space 1}    4.28{col 46}{space 3}0.000{col 54}{space 4} .0159935{col 67}{space 3} .0429955
{txt}{space 6}3.STOR {c |}{col 14}{res}{space 2} .0555373{col 26}{space 2}  .007455{col 37}{space 1}    7.45{col 46}{space 3}0.000{col 54}{space 4} .0409254{col 67}{space 3} .0701492
{txt}{space 12} {c |}
{space 8}WAL1 {c |}
{space 10}2  {c |}{col 14}{res}{space 2} .0836062{col 26}{space 2} .0075509{col 37}{space 1}   11.07{col 46}{space 3}0.000{col 54}{space 4} .0688064{col 67}{space 3} .0984059
{txt}{space 10}4  {c |}{col 14}{res}{space 2}-.0791647{col 26}{space 2} .0076908{col 37}{space 1}  -10.29{col 46}{space 3}0.000{col 54}{space 4}-.0942387{col 67}{space 3}-.0640908
{txt}{space 10}5  {c |}{col 14}{res}{space 2}-.0758465{col 26}{space 2} .0059862{col 37}{space 1}  -12.67{col 46}{space 3}0.000{col 54}{space 4}-.0875794{col 67}{space 3}-.0641136
{txt}{space 10}7  {c |}{col 14}{res}{space 2}-.0106398{col 26}{space 2} .0112191{col 37}{space 1}   -0.95{col 46}{space 3}0.343{col 54}{space 4}-.0326293{col 67}{space 3} .0113497
{txt}{space 10}8  {c |}{col 14}{res}{space 2} .0211272{col 26}{space 2} .0064107{col 37}{space 1}    3.30{col 46}{space 3}0.001{col 54}{space 4} .0085621{col 67}{space 3} .0336922
{txt}{space 12} {c |}
{space 8}WAL2 {c |}
{space 10}1  {c |}{col 14}{res}{space 2} .0773715{col 26}{space 2} .0107781{col 37}{space 1}    7.18{col 46}{space 3}0.000{col 54}{space 4} .0562463{col 67}{space 3} .0984967
{txt}{space 10}2  {c |}{col 14}{res}{space 2} .0784724{col 26}{space 2} .0037831{col 37}{space 1}   20.74{col 46}{space 3}0.000{col 54}{space 4} .0710576{col 67}{space 3} .0858873
{txt}{space 10}4  {c |}{col 14}{res}{space 2} .0964016{col 26}{space 2} .0093278{col 37}{space 1}   10.33{col 46}{space 3}0.000{col 54}{space 4} .0781191{col 67}{space 3} .1146841
{txt}{space 10}5  {c |}{col 14}{res}{space 2}-.0417549{col 26}{space 2} .0065666{col 37}{space 1}   -6.36{col 46}{space 3}0.000{col 54}{space 4}-.0546255{col 67}{space 3}-.0288843
{txt}{space 10}7  {c |}{col 14}{res}{space 2} .1115874{col 26}{space 2}  .003272{col 37}{space 1}   34.10{col 46}{space 3}0.000{col 54}{space 4} .1051743{col 67}{space 3} .1180006
{txt}{space 10}8  {c |}{col 14}{res}{space 2} .1201245{col 26}{space 2} .0054215{col 37}{space 1}   22.16{col 46}{space 3}0.000{col 54}{space 4} .1094983{col 67}{space 3} .1307507
{txt}{space 12} {c |}
{space 8}wals {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 5}2.WATER {c |}{col 14}{res}{space 2}-.0819605{col 26}{space 2} .0082853{col 37}{space 1}   -9.89{col 46}{space 3}0.000{col 54}{space 4}-.0981996{col 67}{space 3}-.0657213
{txt}{space 8}AREA {c |}{col 14}{res}{space 2} 5.02e-07{col 26}{space 2} 8.58e-08{col 37}{space 1}    5.85{col 46}{space 3}0.000{col 54}{space 4} 3.33e-07{col 67}{space 3} 6.70e-07
{txt}{space 7}FFNSQ {c |}{col 14}{res}{space 2}-.0000199{col 26}{space 2} 6.07e-06{col 37}{space 1}   -3.28{col 46}{space 3}0.001{col 54}{space 4}-.0000318{col 67}{space 3}-8.02e-06
{txt}{space 8}FPLS {c |}{col 14}{res}{space 2} .0417054{col 26}{space 2} .0015698{col 37}{space 1}   26.57{col 46}{space 3}0.000{col 54}{space 4} .0386285{col 67}{space 3} .0447823
{txt}{space 8}FULB {c |}{col 14}{res}{space 2}  .126525{col 26}{space 2} .0020616{col 37}{space 1}   61.37{col 46}{space 3}0.000{col 54}{space 4} .1224843{col 67}{space 3} .1305657
{txt}{space 8}HAFB {c |}{col 14}{res}{space 2} .0951326{col 26}{space 2} .0031697{col 37}{space 1}   30.01{col 46}{space 3}0.000{col 54}{space 4}   .08892{col 67}{space 3} .1013452
{txt}{space 8}LOTV {c |}{col 14}{res}{space 2} 1.30e-06{col 26}{space 2} 1.86e-08{col 37}{space 1}   70.13{col 46}{space 3}0.000{col 54}{space 4} 1.27e-06{col 67}{space 3} 1.34e-06
{txt}{space 7}FSQFS {c |}{col 14}{res}{space 2}  .000105{col 26}{space 2} 1.17e-06{col 37}{space 1}   89.91{col 46}{space 3}0.000{col 54}{space 4} .0001027{col 67}{space 3} .0001073
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  12.6976{col 26}{space 2} .0451734{col 37}{space 1}  281.09{col 46}{space 3}0.000{col 54}{space 4} 12.60906{col 67}{space 3} 12.78614
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. vif

{txt}    Variable {c |}       VIF       1/VIF  
{hline 13}{c +}{hline 22}
{space 9}FIN {c |} {res}     1.12    0.895943
{txt}{space 9}acs {c |} {res}     1.31    0.760528
{txt}{space 8}ager {c |} {res}     1.17    0.853722
{txt}{space 7}assoc {c |} {res}     1.34    0.745488
{txt}{space 9}con {c |} {res}     1.74    0.573150
{txt}{space 9}det {c |} {res}     1.54    0.648458
{txt}{space 9}DIV {c |}
{space 10}2  {c |} {res}     3.05    0.327798
{txt}{space 10}3  {c |} {res}     3.65    0.274315
{txt}{space 10}4  {c |} {res}     3.16    0.316059
{txt}{space 10}5  {c |} {res}     5.01    0.199703
{txt}{space 10}6  {c |} {res}     1.68    0.594995
{txt}{space 10}8  {c |} {res}     5.81    0.172224
{txt}{space 10}9  {c |} {res}     1.26    0.794068
{txt}{space 8}fnbs {c |} {res}     1.60    0.625217
{txt}{space 7}foyer {c |} {res}     1.21    0.826754
{txt}{space 7}FRAME {c |}
{space 10}1  {c |} {res}     2.18    0.457887
{txt}{space 10}4  {c |} {res}     2.20    0.453651
{txt}{space 8}HEAT {c |}
{space 10}2  {c |} {res}     1.42    0.703808
{txt}{space 10}3  {c |} {res}     1.39    0.716946
{txt}{space 10}4  {c |} {res}     1.07    0.930922
{txt}{space 7}HEAT2 {c |}
{space 10}1  {c |} {res}     1.09    0.915258
{txt}{space 10}2  {c |} {res}     1.04    0.966156
{txt}{space 10}3  {c |} {res}     1.02    0.976343
{txt}{space 10}4  {c |} {res}     1.10    0.909560
{txt}{space 7}metro {c |} {res}     1.21    0.829700
{txt}{space 5}2.SEWER {c |} {res}     2.76    0.362164
{txt}{space 6}3.STOR {c |} {res}     1.13    0.883319
{txt}{space 8}WAL1 {c |}
{space 10}2  {c |} {res}     4.63    0.215982
{txt}{space 10}4  {c |} {res}     4.03    0.248047
{txt}{space 10}5  {c |} {res}     7.60    0.131556
{txt}{space 10}7  {c |} {res}     1.72    0.579814
{txt}{space 10}8  {c |} {res}     7.42    0.134687
{txt}{space 8}WAL2 {c |}
{space 10}1  {c |} {res}     1.07    0.938714
{txt}{space 10}2  {c |} {res}     1.86    0.538952
{txt}{space 10}4  {c |} {res}     1.14    0.879327
{txt}{space 10}5  {c |} {res}     1.72    0.579995
{txt}{space 10}7  {c |} {res}     2.16    0.462891
{txt}{space 10}8  {c |} {res}     1.91    0.522928
{txt}{space 5}2.WATER {c |} {res}     2.60    0.384951
{txt}{space 8}AREA {c |} {res}     2.04    0.490662
{txt}{space 7}FFNSQ {c |} {res}     1.12    0.889055
{txt}{space 8}FPLS {c |} {res}     1.15    0.869286
{txt}{space 8}FULB {c |} {res}     2.29    0.435790
{txt}{space 8}HAFB {c |} {res}     1.31    0.762973
{txt}{space 8}LOTV {c |} {res}     1.26    0.795052
{txt}{space 7}FSQFS {c |} {res}     2.02    0.495416
{txt}{hline 13}{c +}{hline 22}
    Mean VIF {c |} {res}     2.20
{txt}
{com}. est sto fin3
{txt}
{com}. 
. *attempt at matching algorithm
. *psmatch2 FIN acs ager assoc i.BASE i.CAT con det i.DIV fnbs foyer i.FRAME i.HEAT i.HEAT2 metro i.SEWER i.STOR i.WAL1 i.WAL2 wals i.WATER AREA FFNSQ FPLS FULB HAFB LOTV FSQFS, out(logFSLPR) neighbor(5) ties ate
. 
. ***************************Results********************************
. 
. 
. 
. esttab fin1 fin2 fin3, r2
{res}
{txt}{hline 60}
{txt}                      (1)             (2)             (3)   
{txt}                 logFSLPR        logFSLPR        logFSLPR   
{txt}{hline 60}
{txt}FIN         {res}       -0.384***      -0.0802***      -0.0934***{txt}
            {res} {ralign 12:{txt:(}-194.47{txt:)}}    {ralign 12:{txt:(}-17.37{txt:)}}    {ralign 12:{txt:(}-19.85{txt:)}}   {txt}

{txt}acs         {res}                       0.0845***       0.0837***{txt}
            {res}                 {ralign 12:{txt:(}15.51{txt:)}}    {ralign 12:{txt:(}15.09{txt:)}}   {txt}

{txt}ager        {res}                       0.0433***      0.00170   {txt}
            {res}                 {ralign 12:{txt:(}6.59{txt:)}}    {ralign 12:{txt:(}0.26{txt:)}}   {txt}

{txt}assoc       {res}                     -0.00191         0.00209   {txt}
            {res}                 {ralign 12:{txt:(}-0.66{txt:)}}    {ralign 12:{txt:(}0.72{txt:)}}   {txt}

{txt}1.BASE      {res}                            0               0   {txt}
            {res}                 {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}1.CAT       {res}                            0               0   {txt}
            {res}                 {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}con         {res}                        0.126***        0.144***{txt}
            {res}                 {ralign 12:{txt:(}19.86{txt:)}}    {ralign 12:{txt:(}24.01{txt:)}}   {txt}

{txt}det         {res}                       0.0371***       0.0978***{txt}
            {res}                 {ralign 12:{txt:(}7.99{txt:)}}    {ralign 12:{txt:(}23.61{txt:)}}   {txt}

{txt}1.DIV       {res}                            0               0   {txt}
            {res}                 {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}2.DIV       {res}                       -0.289***       -0.268***{txt}
            {res}                 {ralign 12:{txt:(}-50.70{txt:)}}    {ralign 12:{txt:(}-47.28{txt:)}}   {txt}

{txt}3.DIV       {res}                       -0.429***       -0.409***{txt}
            {res}                 {ralign 12:{txt:(}-75.95{txt:)}}    {ralign 12:{txt:(}-72.37{txt:)}}   {txt}

{txt}4.DIV       {res}                       -0.523***       -0.481***{txt}
            {res}                 {ralign 12:{txt:(}-82.68{txt:)}}    {ralign 12:{txt:(}-77.13{txt:)}}   {txt}

{txt}5.DIV       {res}                       -0.368***       -0.357***{txt}
            {res}                 {ralign 12:{txt:(}-62.14{txt:)}}    {ralign 12:{txt:(}-61.27{txt:)}}   {txt}

{txt}6.DIV       {res}                       -0.677***       -0.644***{txt}
            {res}                 {ralign 12:{txt:(}-75.33{txt:)}}    {ralign 12:{txt:(}-73.32{txt:)}}   {txt}

{txt}8.DIV       {res}                       -0.414***       -0.398***{txt}
            {res}                 {ralign 12:{txt:(}-68.89{txt:)}}    {ralign 12:{txt:(}-66.01{txt:)}}   {txt}

{txt}9.DIV       {res}                        0.249***        0.214***{txt}
            {res}                 {ralign 12:{txt:(}13.73{txt:)}}    {ralign 12:{txt:(}11.57{txt:)}}   {txt}

{txt}fnbs        {res}                      -0.0434***      -0.0526***{txt}
            {res}                 {ralign 12:{txt:(}-15.20{txt:)}}    {ralign 12:{txt:(}-18.27{txt:)}}   {txt}

{txt}foyer       {res}                       0.0527***       0.0662***{txt}
            {res}                 {ralign 12:{txt:(}21.48{txt:)}}    {ralign 12:{txt:(}26.90{txt:)}}   {txt}

{txt}0.FRAME     {res}                            0               0   {txt}
            {res}                 {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}1.FRAME     {res}                       -0.611***       -0.532***{txt}
            {res}                 {ralign 12:{txt:(}-15.25{txt:)}}    {ralign 12:{txt:(}-13.00{txt:)}}   {txt}

{txt}4.FRAME     {res}                       -0.403***       -0.354***{txt}
            {res}                 {ralign 12:{txt:(}-7.33{txt:)}}    {ralign 12:{txt:(}-6.29{txt:)}}   {txt}

{txt}1.GAR       {res}                            0                   {txt}
            {res}                 {ralign 12:{txt:(}.{txt:)}}                   {txt}

{txt}2.GAR       {res}                       0.0287***                {txt}
            {res}                 {ralign 12:{txt:(}4.55{txt:)}}                   {txt}

{txt}3.GAR       {res}                        0.103***                {txt}
            {res}                 {ralign 12:{txt:(}14.79{txt:)}}                   {txt}

{txt}4.GAR       {res}                      -0.0340*                  {txt}
            {res}                 {ralign 12:{txt:(}-2.09{txt:)}}                   {txt}

{txt}1.HEAT      {res}                            0               0   {txt}
            {res}                 {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}2.HEAT      {res}                        0.115***        0.111***{txt}
            {res}                 {ralign 12:{txt:(}28.78{txt:)}}    {ralign 12:{txt:(}27.48{txt:)}}   {txt}

{txt}3.HEAT      {res}                       0.0116          0.0262*  {txt}
            {res}                 {ralign 12:{txt:(}1.07{txt:)}}    {ralign 12:{txt:(}2.37{txt:)}}   {txt}

{txt}4.HEAT      {res}                        0.192***        0.112***{txt}
            {res}                 {ralign 12:{txt:(}6.21{txt:)}}    {ralign 12:{txt:(}3.55{txt:)}}   {txt}

{txt}0.HEAT2     {res}                            0               0   {txt}
            {res}                 {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}1.HEAT2     {res}                        0.175***        0.209***{txt}
            {res}                 {ralign 12:{txt:(}21.65{txt:)}}    {ralign 12:{txt:(}25.96{txt:)}}   {txt}

{txt}2.HEAT2     {res}                      -0.0835*        -0.0204   {txt}
            {res}                 {ralign 12:{txt:(}-2.18{txt:)}}    {ralign 12:{txt:(}-0.52{txt:)}}   {txt}

{txt}3.HEAT2     {res}                      -0.0733          -0.125*  {txt}
            {res}                 {ralign 12:{txt:(}-1.51{txt:)}}    {ralign 12:{txt:(}-2.49{txt:)}}   {txt}

{txt}4.HEAT2     {res}                        0.145***        0.161***{txt}
            {res}                 {ralign 12:{txt:(}15.28{txt:)}}    {ralign 12:{txt:(}16.55{txt:)}}   {txt}

{txt}0.LNDR      {res}                            0                   {txt}
            {res}                 {ralign 12:{txt:(}.{txt:)}}                   {txt}

{txt}1.LNDR      {res}                       -0.241***                {txt}
            {res}                 {ralign 12:{txt:(}-18.09{txt:)}}                   {txt}

{txt}2.LNDR      {res}                       -0.158***                {txt}
            {res}                 {ralign 12:{txt:(}-12.85{txt:)}}                   {txt}

{txt}3.LNDR      {res}                       -0.157***                {txt}
            {res}                 {ralign 12:{txt:(}-12.78{txt:)}}                   {txt}

{txt}5.LNDR      {res}                       -0.126*                  {txt}
            {res}                 {ralign 12:{txt:(}-2.56{txt:)}}                   {txt}

{txt}6.LNDR      {res}                       -0.261***                {txt}
            {res}                 {ralign 12:{txt:(}-13.85{txt:)}}                   {txt}

{txt}metro       {res}                      -0.0904***      -0.0173   {txt}
            {res}                 {ralign 12:{txt:(}-4.72{txt:)}}    {ralign 12:{txt:(}-1.01{txt:)}}   {txt}

{txt}1.MFGS      {res}                            0                   {txt}
            {res}                 {ralign 12:{txt:(}.{txt:)}}                   {txt}

{txt}2.MFGS      {res}                        0.229***                {txt}
            {res}                 {ralign 12:{txt:(}16.65{txt:)}}                   {txt}

{txt}3.MFGS      {res}                        0.141***                {txt}
            {res}                 {ralign 12:{txt:(}10.86{txt:)}}                   {txt}

{txt}1.SEWER     {res}                            0               0   {txt}
            {res}                 {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}2.SEWER     {res}                       0.0415***       0.0295***{txt}
            {res}                 {ralign 12:{txt:(}6.14{txt:)}}    {ralign 12:{txt:(}4.28{txt:)}}   {txt}

{txt}2.STOR      {res}                            0               0   {txt}
            {res}                 {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}3.STOR      {res}                       0.0836***       0.0555***{txt}
            {res}                 {ralign 12:{txt:(}11.43{txt:)}}    {ralign 12:{txt:(}7.45{txt:)}}   {txt}

{txt}1.WAL1      {res}                            0               0   {txt}
            {res}                 {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}2.WAL1      {res}                       0.0655***       0.0836***{txt}
            {res}                 {ralign 12:{txt:(}8.75{txt:)}}    {ralign 12:{txt:(}11.07{txt:)}}   {txt}

{txt}4.WAL1      {res}                      -0.0963***      -0.0792***{txt}
            {res}                 {ralign 12:{txt:(}-12.57{txt:)}}    {ralign 12:{txt:(}-10.29{txt:)}}   {txt}

{txt}5.WAL1      {res}                      -0.0957***      -0.0758***{txt}
            {res}                 {ralign 12:{txt:(}-15.78{txt:)}}    {ralign 12:{txt:(}-12.67{txt:)}}   {txt}

{txt}7.WAL1      {res}                      0.00626         -0.0106   {txt}
            {res}                 {ralign 12:{txt:(}0.56{txt:)}}    {ralign 12:{txt:(}-0.95{txt:)}}   {txt}

{txt}8.WAL1      {res}                     -0.00340          0.0211***{txt}
            {res}                 {ralign 12:{txt:(}-0.52{txt:)}}    {ralign 12:{txt:(}3.30{txt:)}}   {txt}

{txt}0.WAL2      {res}                            0               0   {txt}
            {res}                 {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}1.WAL2      {res}                       0.0612***       0.0774***{txt}
            {res}                 {ralign 12:{txt:(}5.72{txt:)}}    {ralign 12:{txt:(}7.18{txt:)}}   {txt}

{txt}2.WAL2      {res}                       0.0592***       0.0785***{txt}
            {res}                 {ralign 12:{txt:(}15.89{txt:)}}    {ralign 12:{txt:(}20.74{txt:)}}   {txt}

{txt}4.WAL2      {res}                       0.0677***       0.0964***{txt}
            {res}                 {ralign 12:{txt:(}7.42{txt:)}}    {ralign 12:{txt:(}10.33{txt:)}}   {txt}

{txt}5.WAL2      {res}                      -0.0706***      -0.0418***{txt}
            {res}                 {ralign 12:{txt:(}-10.86{txt:)}}    {ralign 12:{txt:(}-6.36{txt:)}}   {txt}

{txt}7.WAL2      {res}                       0.0941***        0.112***{txt}
            {res}                 {ralign 12:{txt:(}29.23{txt:)}}    {ralign 12:{txt:(}34.10{txt:)}}   {txt}

{txt}8.WAL2      {res}                       0.0907***        0.120***{txt}
            {res}                 {ralign 12:{txt:(}16.95{txt:)}}    {ralign 12:{txt:(}22.16{txt:)}}   {txt}

{txt}wals        {res}                            0               0   {txt}
            {res}                 {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}1.WATER     {res}                            0               0   {txt}
            {res}                 {ralign 12:{txt:(}.{txt:)}}    {ralign 12:{txt:(}.{txt:)}}   {txt}

{txt}2.WATER     {res}                      -0.0910***      -0.0820***{txt}
            {res}                 {ralign 12:{txt:(}-11.17{txt:)}}    {ralign 12:{txt:(}-9.89{txt:)}}   {txt}

{txt}AREA        {res}                  0.000000297***  0.000000502***{txt}
            {res}                 {ralign 12:{txt:(}3.47{txt:)}}    {ralign 12:{txt:(}5.85{txt:)}}   {txt}

{txt}0.BEDR      {res}                            0                   {txt}
            {res}                 {ralign 12:{txt:(}.{txt:)}}                   {txt}

{txt}2.BEDR      {res}                       0.0287                   {txt}
            {res}                 {ralign 12:{txt:(}1.17{txt:)}}                   {txt}

{txt}3.BEDR      {res}                     -0.00256                   {txt}
            {res}                 {ralign 12:{txt:(}-0.11{txt:)}}                   {txt}

{txt}4.BEDR      {res}                       0.0935***                {txt}
            {res}                 {ralign 12:{txt:(}3.98{txt:)}}                   {txt}

{txt}5.BEDR      {res}                       0.0400                   {txt}
            {res}                 {ralign 12:{txt:(}1.71{txt:)}}                   {txt}

{txt}FFNSQ       {res}                   -0.0000168**    -0.0000199** {txt}
            {res}                 {ralign 12:{txt:(}-2.84{txt:)}}    {ralign 12:{txt:(}-3.28{txt:)}}   {txt}

{txt}FPLS        {res}                       0.0338***       0.0417***{txt}
            {res}                 {ralign 12:{txt:(}21.86{txt:)}}    {ralign 12:{txt:(}26.57{txt:)}}   {txt}

{txt}FULB        {res}                        0.124***        0.127***{txt}
            {res}                 {ralign 12:{txt:(}53.87{txt:)}}    {ralign 12:{txt:(}61.37{txt:)}}   {txt}

{txt}HAFB        {res}                       0.0747***       0.0951***{txt}
            {res}                 {ralign 12:{txt:(}23.72{txt:)}}    {ralign 12:{txt:(}30.01{txt:)}}   {txt}

{txt}LOTV        {res}                   0.00000120***   0.00000130***{txt}
            {res}                 {ralign 12:{txt:(}65.68{txt:)}}    {ralign 12:{txt:(}70.13{txt:)}}   {txt}

{txt}FSQFS       {res}                    0.0000953***     0.000105***{txt}
            {res}                 {ralign 12:{txt:(}79.69{txt:)}}    {ralign 12:{txt:(}89.91{txt:)}}   {txt}

{txt}_cons       {res}        12.77***        12.94***        12.70***{txt}
            {res} {ralign 12:{txt:(}17568.12{txt:)}}    {ralign 12:{txt:(}237.10{txt:)}}    {ralign 12:{txt:(}281.09{txt:)}}   {txt}
{txt}{hline 60}
{txt}N           {res}       376938           56609           56609   {txt}
{txt}R-sq        {res}        0.091           0.629           0.608   {txt}
{txt}{hline 60}
{txt}t statistics in parentheses
{txt}* p<0.05, ** p<0.01, *** p<0.001

{com}. 
. 
. 
. 
. 
. 
. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\Isaac\Documents\GitHub\soc-analysis\Econ643 - Update.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}23 Sep 2018, 13:50:56
{txt}{.-}
{smcl}
{txt}{sf}{ul off}